Reports/РаботаКонструктра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РаботаКонструктра</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/РаботаКонструктра/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет();
КонецПроцедуры

Процедура СформироватьОтчет()

	ПолеВывода.Очистить();
	
	СекундВСутках = 3600 * 24;
	
	МенеджерОтчета = Отчеты.РаботаКонструктра;
	
	Макет = МенеджерОтчета.ПолучитьМакет("Макет");
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекущаяОбласть.Параметры.Заполнить(ЭтаФорма);
	ПолеВывода.Вывести(ТекущаяОбласть);
	ПолеВывода.ФиксацияСверху = ПолеВывода.ВысотаТаблицы;
	
	ТекущаяОбласть 	= Макет.ПолучитьОбласть("Строка");
	ОбъектТЗОбласть = Макет.ПолучитьОбласть("ОбъектТЗ");
	ВРаботеОбласть 	= Макет.ПолучитьОбласть("ВРаботе");
	ТаблицаТайминга = РегистрыСведений.ТаймингЗадач.ПолучитьТаймингиЗадачКонструктор(Период,Конструктор).ТайминЗадач;
	
	ОбъектыТЗКонструктора = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаТайминга, "ОбъектТЗ");
	
	ТаблицаТайминга.Сортировать("ОбъектТЗНаименование, ДатаНачала");
	Отбор = Новый Структура("ОбъектТЗ", );
	
	ТекущийОбъектТЗ = Неопределено; 
	
	ТаблицаВыводаОбъектаТЗ = СоздатьТаблицуВывода();
	
	Для каждого СтрокаЗадач Из ТаблицаТайминга Цикл
		
		Если НЕ ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ Тогда
		
			Отбор.ОбъектТЗ = СтрокаЗадач.ОбъектТЗ;
			ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках);
			
			ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ;	
		    ОбъектТЗОбласть.Параметры.Заполнить(СтрокаЗадач);
			ПолеВывода.Вывести(ОбъектТЗОбласть); 
			
			Для каждого х Из ТаблицаВыводаОбъектаТЗ Цикл
				
				Если х.Вработе Тогда
					ВРаботеОбласть.Параметры.Заполнить(х);
					ПолеВывода.Вывести(ВРаботеОбласть);
				Иначе
					ТекущаяОбласть.Параметры.Заполнить(х);
					ПолеВывода.Вывести(ТекущаяОбласть);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
		//ТекущаяОбласть.Параметры.Заполнить(СтрокаЗадач);
		//
		//Норма 	= 0;
		//Факт 	= 0;
		//План 	= 0; 
		//
		//ИтогоДоработка 	= 0;
		//ИтогоФакт		= 0;
		//
		//Отбор.ОбъектТЗ = СтрокаЗадач.ОбъектТЗ;
		//
		//Для каждого х Из ТаблицаТайминга.НайтиСтроки(Отбор) Цикл
		//
		//	Если НЕ х.Ожидание И Конструктор = х.Исполнитель Тогда
		//	
		//		Если х.Доработка Тогда
		//			ИтогоДоработка = ИтогоДоработка + х.ПродолжительностьВЧасах;
		//		КонецЕсли;
		//		
		//		//ИтогоФакт = ИтогоФакт + х.ПродолжительностьВЧасах;
		//		
		//		Норма 	= Норма + х.НормаВремени;
		//		//Факт 	= Факт 	+ х.ПродолжительностьВЧасах;
		//		План 	= План 	+ х.ПлановоеЗначение;
		//	КонецЕсли;	
		//
		//КонецЦикла;
		//
		//ТекущаяОбласть.Параметры.Норма 	= Норма;
		////ТекущаяОбласть.Параметры.Факт 	= Факт / 24;
		//ТекущаяОбласть.Параметры.План 	= План;

		//ПолеВывода.Вывести(ТекущаяОбласть);

	КонецЦикла;

КонецПроцедуры 

Функция ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках)
	
	ДанныеВозврата = Новый Структура("Норма, Факт, План, ОписаниеОбъектаТЗ", 0, 0, 0, "");
	
	ТаблицаВыводаОбъектаТЗ.Очистить(); 
	
	НайденыеСтроки = ТаблицаТайминга.НайтиСтроки(Отбор);
	
	МаксимальныйИндекс = НайденыеСтроки.Количество() - 1;
	
	ОжиданиеРаботы = Истина;
	
	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = ТаблицаТайминга[х];
		
		НС = ТаблицаВыводаОбъектаТЗ.Добавить();
		НС.ДатаНачала 			= СтрокаТайминга.ДатаНачала;
		НС.Норма 				= СтрокаТайминга.НормаВремени;
		НС.Стадия 				= СтрокаТайминга.Стадия;
		НС.СтадияНаименование	= СтрокаТайминга.СтадияНаименование;
		НС.ВРаботе 				= СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		
		Если х < МаксимальныйИндекс Тогда
			
			СтрокаТаймингаСледующая 	= ТаблицаТайминга[х + 1];
			НС.Факт 					= Окр((СтрокаТаймингаСледующая.ДатаНачала - СтрокаТайминга.ДатаНачала) / СекундВСутках, 2);
			
		КонецЕсли;  		
		
	КонецЦикла;
	
	Если МаксимальныйИндекс >= 0 Тогда
		
		НС.Факт = Окр((ТекущаяДата() - СтрокаТайминга.ДатаНачала) / СекундВСутках, 2);
		
	КонецЕсли;
	
КонецФункции


Функция СоздатьТаблицуВывода()

	ОписаниеЧисла5_2 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	
	ТаблицаВыводаОбъектаТЗ = Новый ТаблицаЗначений;
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Стадия", 				Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтадияНаименование", 	Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Факт", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("План", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Норма", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтруктураНорма",		Новый ОписаниеТипов("СписокЗначений"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ВРаботе", 				Новый ОписаниеТипов("Булево"));

	Возврат ТаблицаВыводаОбъектаТЗ;
	
КонецФункции // СоздатьТаблицуВывода()
